const dConfig = {
  // 表头背景色
  headerBGC: '#443dc5',
  // 奇数行背景色
  oddRowBGC: '#09184F',
  // 偶数行背景色#070C34
  evenRowBGC: '#070C34',
  // 行号
  index: true,
  // 行号表头
  indexHeader: '序号',
  // 宽度
  columnWidth: [80, 120, 100, 100],
  // 对其方式
  align: ['center'],
  // 表行数
  rowNum: 10,
  //轮播时间间隔
  waitTime:100000,
  //悬浮暂停轮播
  hoverPause:false,
}

const dUserSitua = {
  header: ['设备', '区域', '状态'],
  data: [
    ['应急人员1', '武汉市', '在线'],
    ['应急人员2', '武汉市', '离线'],
    // ['应急人员3', '武汉市', '离线'],
    // ['设备4', '武汉市', '在线'],
    // ['设备5', '武汉市', '离线'],
    // ['设备6', '武汉市', '离线'],
    // ['设备7', '武汉市', '离线'],
    // ['设备8', '武汉市', '离线'],
    // ['设备9', '武汉市', '离线'],
    // ['设备10', '武汉市', '离线'],
    // ['设备11', '武汉市', '离线'],

  ],
}

const dUserLocation = [
  [114.35090337586192, 30.53613887992898],
  [114.33302282960804, 30.515262430756277],
  [114.36301802074884, 30.518725460348364],
  [114.35040065788635, 30.53936009794829],
  [114.35135934630722, 30.544129919780506],
  [114.35501232282057, 30.538849910565528],
  [114.35559717183631, 30.526847123941646],
  [114.37135791833657, 30.534052359760707],
  [114.36609468495658, 30.534122117108378],
  [114.35288767237526, 30.53614335674394],
  [114.35502940138402, 30.51229491767049],
  [114.3426604574799, 30.509642773951622],
  [114.31056215292757, 30.524848525815386],
  [114.29556802949575, 30.52909355872916],
  [114.31659602498651, 30.573390146529352],
  [114.30005160763554, 30.55757115365485],
]

const dimgurls = 
  [
    ['http://192.168.1.101:8080/?action=stream','http://192.168.1.100:8080/?action=stream'],
    ['http://192.168.1.102:8080/?action=stream','http://192.168.1.101:8080/?action=stream'],
    ['http://192.168.1.101:8080/?action=stream','http://192.168.1.101:8080/?action=stream'],
    ['http://192.168.1.102:8080/?action=stream','http://192.168.1.101:8080/?action=stream'],
    ['http://192.168.1.101:8080/?action=stream','http://192.168.1.101:8080/?action=stream'],
    ['http://192.168.1.102:8080/?action=stream','http://192.168.1.101:8080/?action=stream'],
    ['http://192.168.1.101:8080/?action=stream','http://192.168.1.101:8080/?action=stream'],
    ['http://192.168.1.102:8080/?action=stream','http://192.168.1.101:8080/?action=stream'],
    ['http://192.168.1.101:8080/?action=stream','http://192.168.1.101:8080/?action=stream'],
    ['http://192.168.1.101:8080/?action=stream','http://192.168.1.101:8080/?action=stream'],
    ['http://192.168.1.101:8080/?action=stream','http://192.168.1.101:8080/?action=stream'],
    ['http://192.168.1.101:8080/?action=stream','http://192.168.1.101:8080/?action=stream'],
    ['http://192.168.1.101:8080/?action=stream','http://192.168.1.101:8080/?action=stream'],
    ['http://192.168.1.101:8080/?action=stream','http://192.168.1.101:8080/?action=stream'],
    ['http://192.168.1.101:8080/?action=stream','http://192.168.1.101:8080/?action=stream'],
    ['http://192.168.1.101:8080/?action=stream','http://192.168.1.101:8080/?action=stream'],
  ]

const dUsername = []
export { dConfig, dUserSitua, dUserLocation, dimgurls }